lib/EWS_Calls/findfolder_folderId.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
  <t:RequestServerVersion Version="REPLACE_EXCHANGE_VERSION" />
</soap:Header>
<soap:Body>
  <FindFolder Traversal="Shallow" xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
    <FolderShape>
      <t:BaseShape>IdOnly</t:BaseShape>
      <t:AdditionalProperties>
          <t:FieldURI FieldURI="folder:DisplayName" />
      </t:AdditionalProperties>
    </FolderShape>
	  <m:IndexedPageFolderView MaxEntriesReturned="REPLACE_MAX_ENTRIES" Offset="REPLACE_OFFSET" BasePoint="REPLACE_BASEPOINT" />
    <ParentFolderIds>
      <t:FolderId Id="REPLACE_PARENT_FOLDER_ID" ChangeKey="REPLACE_FOLDER_CHANGE_KEY" />
    </ParentFolderIds>
  </FindFolder>
</soap:Body>
</soap:Envelope>